Repository: va1entin/ucs-school
Catalog: ucs-school-umc-installer/umc/js/*.po
Languages: de

source: " is still in use. Otherwise the corresponding host object has to be deleted first.
de: " weiterhin in Benutzung ist. Falls nicht, muss das entsprechende Rechnerobjekt zuvor gelöscht werden.

source: <p>During the installation of UCS@school a demo school including some users and a portal will be configured for testing purposes. If you do not wish that, please set the UCR variable <emp>ucsschool/join/create_demo</emp> to <emp>no</emp> prior to the installation.</p>
de: <p>Während der Installation von UCS@school wird zu Testzwecken eine Demoschule inklusive einiger Nutzer und einem Portal vorkonfiguriert. Zur Deaktivierung dieser Funktion setzen Sie bitte die UCR Variable <emp>ucsschool/join/create_demo</emp> auf <emph>no</emph>, bevor Sie mit der Installation fortfahren.</p>

source: <p>In a multi server environment, the master domain controller system is configured as central instance hosting the complete set of LDAP data. Each school is configured to have its own slave domain controller system that selectively replicates the school's own LDAP OU structure. In that way, different schools do not have access to data from other schools, they only see their own data. Teaching related UMC modules are only accessible on the slave domain controller. The master domain controller does not provide UMC modules for teachers. After configuring a master system, one or more slave systems must be configured and joined into the UCS@school domain.</p>
de: In einer Multi-Server-Umgebung ist der Domänencontroller Master als zentrale Instanz konfiguriert, die den gesamten LDAP-Datensatz vorhält. Jeder Schule ist ein eigener Domänencontroller Slave zugeordnet, der jeweils die schuleigene LDAP-OU-Strukutur selektiv repliziert. Auf diese Weise hat eine Schule keinen Zugriff auf die Daten anderer Schulen, da nur die eigenen Daten lokal gesichert werden. Unterrichtsbezogene UMC-Module sind nur vom jeweiligen Domänencontroller Slave zugänglich. Der Domänencontroller Master stellt keine UMC-Module für Lehrer bereit. Nachdem das Master-System konfiguriert wurde, müssen ein oder mehrere Slave-Systeme konfiguriert werden und der Domäne beitreten.

source: <p>In a single server environment, the master domain controller system is configured as standalone UCS@school server instance. All school related data and thus all school OU structures are hosted and accessed on the master domain controller itself. Teaching related UMC modules are provided directly on the master itself. Note that this setup can lead to performance problems in larger environments.</p>
de: <p>In einem Single-Server-Umgebung ist der Domänencontroller-Master als allein stehende UCS@school-Server-Instanz konfiguriert. Alle schulbezogenen Daten und damit alle Schul-OU-Strukturen werden auf dem Domänencontroller Master selber gespeichert und von dort aus für den Zugriff bereitgestellt. Unterrichtsbezogene UMC-Module sind direkt auf dem Master-System verfügbar. Diese Konfiguration kann in größeren Umgebung zu Performance-Problemen führen.</p>

source: <p>The UCS@school multi server environment distinguishes between educational servers and administrative servers. The educational servers provide all educational functions of UCS@school. The administrative servers only provide a very limited set of functions, e.g. logon services for staff users.</p><p>Usually the domain controller slave is configured as educational server.</p>
de: <p>Die UCS@school Multi-Server-Umgebung unterscheidet zwischen edukativen Schulservern und Verwaltungsservern. Die edukativen Schulserver stellen alle edukativen Funktionen von UCS@school bereit. Die Server des Verwaltungsnetzes bieten nur einen eingeschränkten Funktionsumfang an (z.B. Anmeldedienste für Mitarbeiter in der Verwaltung).</p><p>In den meisten Fällen ist die Konfiguration des Domänencontroller Slave als edukativer Schulserver sinnvoll.</p>

source: <p>The local server role is slave domain controller, for which only a multi server environment can be configured.</p>
de: <p>Die lokale Serverrolle ist Domänencontroller Slave. Diese Rolle kann nur für eine Multi-Server-Umgebung konfiguriert werden.</p>

source: <p>This wizard guides you step by step through the installation of UCS@school in your domain.</p><p>For the installation of UCS@school, there exist two different environment types: the single server environment and the multi server environment. The selection of an environment type has implications for the following installation steps. Further information for the selected environment type will be displayed below.</p>
de: <p>Dieser Assistent begleitet Sie Schritt für Schritt bei der Installation von UCS@school in Ihrer Domäne.</p><p>Es gibt zwei mögliche Installationsszenarien für UCS@school: Eine Single-Server-Umgebung und eine Multi-Server-Umgebung. Die Auswahl eines der beiden Szenarien hat Auswirkungen auf die nachfolgenden Installationsschritte. Weitere Hinweise für die jeweilige Umgebung werden untenstehend angezeigt.</p>

source: Administrative server
de: Verwaltungsserver

source: All necessary information for the installation of UCS@school on this system has been collected. It is recommended to wait with any other activity on the system until the installation has been completed. Please confirm now to continue with the installation process.
de: Alle für die Installation von UCS@school auf diesem System notwendigen Informationen wurden zusammengetragen. Es wird empfohlen während der Installation keine anderen Aktionen auf dem System auszuführen. Bitte bestätigen Sie jetzt, um mit dem Installationsprozess zu beginnen.

source: An error occurred during the installation of UCS@school. The following information will give you some more details on which problems occurred during the installation process.
de: Ein Fehler trat während der Installation von UCS@school auf. Die folgenden Informationen werden genauere Hinweise zu den aufgetretenen Problem geben.

source: Cancel
de: Abbrechen

source: Could not find the DNS entry for the domain controller master.
de: Konnte keinen DNS-Eintrag für dem Domänencontroller Master finden.

source: Domain password
de: Domänenpasswort

source: Domain username
de: Domänenbenutzername

source: During installation this server will be configured as administrative server. To create the specified school, the name of a second/future domain controller slave is required, which will be configured as educational server.
de: Während der Installation wird dieser Server als Verwaltungsserver konfiguriert. Um die angegebene Schule zu erstellen, wird zusätzlich der Name eines zweiten/zukünftigen Domänencontroller Slave benötigt, der als edukativer Schulserver konfiguriert wird.

source: Educational server
de: Edukativer Schulserver

source: Error
de: Fehler

source: For the single server environment, all school OUs are accessed from the master system itself.
de: In einer Single-Server-Umgebung werden alle Schul-OUs von dem Domänencontroller Master selbst verwaltet.

source: Fully qualified domain name of master domain controller (e.g. schoolmaster.example.com)
de: Der vollständige Domänenname des Domänencontroller Masters (bspw. schoolmaster.example.com)

source: In UCS@school, each school is organized in its own LDAP organizational unit (so-called OU). All school related information (students, classes, computers, rooms, groups etc.) is organized below such an OU. Please enter the name of a school OU that will be created during the installation process.
de: Für UCS@school wird jede Schule ihrer eigenen LDAP-Organisationeinheit zugeordnet (die sogenannte Organizational Unit oder auch kurz OU). Alle schulbezogenen Informationen (Schüler, Klassen, Computer, Räume, Gruppen etc.) werden unterhalb dieser OU angelegt und verwaltet. Bitte geben Sie den Namen der Schul-OU ein, die während des Installationsvorgangs erzeugt werden soll.

source: In order to complete the installation of UCS@school, a restart of the UMC server components is necessary.
de: Um die Installation von UCS@school abzuschließen, ist ein Neustart der UMC-Server-Komponenten notwendig.

source: In order to install UCS@school on a backup domain controller, the system needs to be joined first.
de: Bevor UCS@school auf einem Domänencontroller Backup installiert werden kann, muss dieses System zuerst der Domäne beigetreten sein.

source: In order to setup this system as UCS@school slave domain controller, please enter the domain credentials of a domain account with join privileges.
de: Bitte geben Sie die Anmeldedaten eines Domänenkontos mit Join-Rechten an, um dieses System als Domänencontroller Slave für UCS@school zu konfigurieren.

source: Install
de: Installieren

source: Make sure the DNS server is up and running or check the DNS settings.
de: Bitte stellen Sie sicher, dass die DNS-Server erreichbar sind oder überprüfen Sie die DNS-Einstellungen.

source: Multi server environment
de: Multi-Server-Umgebung

source: Name of educational school server
de: Name des Schulservers im Edukativnetz

source: Name of the educational domain controller slave for the new school. The server name may consist of the letters a-z, the digits 0-9 and hyphens (-). The name of the educational server may not be equal to the administrative server!
de: Name des edukativen Schulservers der neuen Schule. Der Servername darf aus den Buchstaben a-z, den Ziffern 0-9 und dem Bindestrich (-) bestehen. Der Name des edukativen Schulservers darf nicht identisch mit dem Namen des Verwaltungsservers sein!

source: Name of the school
de: Name der Schule

source: New school classes can be created with the %s.
de: Neue Schulklassen können mit dem %s erstellt werden.

source: Note that each slave domain controller system is directly associated with a school OU. A slave domain controller has only access to the data below its own school OU, not to data from other schools.
de: Ein Domänencontroller Slave ist direkt einer Schul-OU zugeordnet. Der Slave hat nur Zugang zu den Daten unterhalb seiner eigenen Schul-OU, auf Daten anderer Schulen kann nicht zugegriffen werden.

source: Please choose an environment type:
de: Bitte wählen Sie ein Installationsszenario aus:

source: Please choose the server type for this domain controller slave:
de: Bitte wählen Sie den gewünschten Servertyp für dieses System aus:

source: Retry
de: Wiederholen

source: School abbreviation
de: Schulkürzel

source: Single server environment
de: Single-Server-Umgebung

source: Starting the configuration process...
de: Beginne den Konfigurationsprozess...

source: Teachers and students can be added to the UCS@school domain with the %s.
de: Lehrer und Schüler können mit dem %s in der UCS@school-Domäne neu angelegt werden.

source: Teachers can be assigned to classes with the %s.
de: Lehrer können mit dem %s Klassen zugeordnet werden.

source: The DNS settings can be adjusted in the %s.
de: Die DNS-Einstellungen können im %s angepasst werden.

source: The UCS@school configuration wizard detected all necessary information to install UCS@school on this DC Backup. Click <i>next</i> to start the installation.
de: Der UCS@school-Konfigurationsassistent hat alle benötigten Informationen erkannt, um UCS@school auf diesem DC Backup zu installieren. Klicken Sie auf <i>Weiter</i> um die Installation zu starten.

source: The given value will be shown as school's name within UCS@school.
de: Der hier eingegebene Wert wird innerhalb von UCS@school als Name für die neue Schule verwendet.

source: The given value will be used as object name for the new school OU object within the LDAP directory and as prefix for several school objects like group names. It may consist of the letters a-z, the digits 0-9 and underscores. Usually it is safe to keep the suggested value.
de: Der angegebene Wert wird als Objektname für das neue Schul-OU-Objekt im LDAP-Verzeichnis sowie als Präfix für unterschiedliche Schulobjekte, wie z.B. Gruppennamen, verwendet. Er darf aus den Buchstaben a-z, den Ziffern 0-9 und dem Unterstrich (_) bestehen. In der Regel kann der automatisch vorgeschlagene Wert unverändert übernommen werden.

source: The installation of UCS@school has been finished successfully.
de: Die Installation von UCS@school wurde erfolgreich abgeschlossen.

source: There are several modules that assist in further configuring the UCS@school domain:
de: Es gibt verschiedene Module, die bei der weiteren Konfiguration der UCS@school-Domäne behilflich sind:

source: This wizard guides you step by step through the installation of an UCS@school slave domain controller. Before continuing please make sure that an UCS@school master domain controller has already been set up for a multi server environment.
de: Dieser Assistent begleitet Sie Schritt für Schritt bei der Installation eines UCS@school Domänencontroller Slave. Bitte stellen Sie sicher, dass ein UCS@school Domänencontroller Master bereits für eine Multi-Server-Umgebung eingerichtet wurde.

source: UCS@school - an error ocurred
de: UCS@school - ein Fehler trat auf

source: UCS@school - domain credentials
de: UCS@school - Anmeldedaten

source: UCS@school - educational server vs. administrative server
de: UCS@school - edukative Schulserver/Verwaltungsserver

source: UCS@school - extended school OU setup
de: UCS@school - Erweiterte Schul-OU-Konfiguration

source: UCS@school - installation successful
de: UCS@school - Installation erfolgreich

source: UCS@school - school OU setup
de: UCS@school - Schul-OU-Konfiguration

source: UCS@school - server setup
de: UCS@school - Server-Konfiguration

source: UCS@school can only be installed on the system roles master domain controller, backup domain controller, or slave domain controller.
de: UCS@school kann nur auf den Serverrollen Domänencontroller Master, Domänencontroller Backup oder Domänencontroller Slave installiert werden.

source: UCS@school has already been configured on this system.
de: UCS@school wurde bereits auf diesem System eingerichtet.

source: UCS@school supports only one administrative server per school. Please check if the administrative server "
de: UCS@school unterstützt nur einen Verwaltungsserver pro Schule. Bitte prüfen Sie, ob der Verwaltungsserver "

source: UCS@school supports only one educational server per school. Please check if the educational server "
de: UCS@school unterstützt nur einen edukativen Schulserver pro Schule. Bitte prüfen Sie, ob der Schulserver "

source: Warning:
de: Warnung:

source: Workgroups can be created and managed with the %s.
de: Arbeitsgruppen können mit dem %s erstellt und verwaltet werden.
